{"config": [{"config": {"trainable": true, "input_dtype": "float32", "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ef\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "output_shape": [66, 200, 3], "arguments": {}}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "input_dtype": "float32", "nb_filter": 24, "bias": true, "activation": "relu", "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_row": 5, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "border_mode": "valid", "nb_col": 5, "W_constraint": null, "subsample": [2, 2], "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 36, "bias": true, "activation": "relu", "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_row": 5, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "border_mode": "valid", "nb_col": 5, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 48, "bias": true, "activation": "relu", "name": "convolution2d_3", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_row": 5, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "border_mode": "valid", "nb_col": 5, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 64, "bias": true, "activation": "relu", "name": "convolution2d_4", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_row": 3, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "border_mode": "valid", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "nb_filter": 64, "bias": true, "activation": "relu", "name": "convolution2d_5", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_row": 3, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "border_mode": "valid", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "output_dim": 100, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "output_dim": 50, "W_regularizer": {"l2": 0.0, "l1": 0.0, "name": "WeightRegularizer"}, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "W_regularizer": null, "W_constraint": null, "name": "dense_4", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}